# pandas

In [3]:
from pandas import Series, DataFrame # 대문자 주의 Series, DastaFrame
import pandas as pd
import numpy as np
import random as rd

In [4]:
obj=Series([29,30,80,50],index=["kim","david","han","lee"])
obj["kim":"han"] # 문자 인덱스로 슬라이싱 가능 [a:b]이면 a에서 b의 값까지 출력 (0부터 세는 거랑 관련없음)

kim      29
david    30
han      80
dtype: int64

In [ ]:
obj1=obj[(obj>=30)]
'obj1

In [ ]:
np.exp(obj1) # values가 식 적용되어 출력됨

In [6]:
dic={"kim":29,"david":30,"han":90,"lee":80}
obj1=Series(dic,index=("kim","son","lee","han"))
obj1, pd.notnull(obj1)

(kim    29.0
 son     NaN
 lee    80.0
 han    90.0
 dtype: float64, kim     True
 son    False
 lee     True
 han     True
 dtype: bool)

In [7]:
obj2=Series([10,20,30,40],index=["han","kim","cho","son"]) # NaN + values = NaN
print(obj1+obj2)

cho      NaN
han    100.0
kim     49.0
lee      NaN
son      NaN
dtype: float64

In [8]:
k=obj1+obj2
obj_name= (k).name="Total"
k.index.name="choi"
k

choi
cho      NaN
han    100.0
kim     49.0
lee      NaN
son      NaN
Name: Total, dtype: float64

In [9]:
data={"gender":["F","M","F","M"],"score":[50,70,65,90],"grade":["D","C","D","A"]}
df=DataFrame(data)
df1=DataFrame(data,columns=["score","grade","gender"])
print("{0}\n\n{1}".format(df,df1))

  gender  score grade
0      F     50     D
1      M     70     C
2      F     65     D
3      M     90     A

   score grade gender
0     50     D      F
1     70     C      M
2     65     D      F
3     90     A      M

In [10]:
ar=np.array([[50,70,65,90],[2,4,5,6],[4,5,2,4]])
df2=DataFrame(ar,columns=["v1","v2","v3","v4"],index=["a","b","c"])
df2,df2.columns,df2.index

(   v1  v2  v3  v4
 a  50  70  65  90
 b   2   4   5   6
 c   4   5   2   4,
 Index(['v1', 'v2', 'v3', 'v4'], dtype='object'),
 Index(['a', 'b', 'c'], dtype='object'))

In [11]:
print("{0}\n{1}\n{2}".format(df2.ix["a"],df2.loc["a":"c"],df2.iloc[1:3])) # 온전한 dataframe 형태로 특정 행들만 보고 싶다면 : 사용
                                                                        # index가 컬럼 리스트인 Serie 형태로 보고 싶다면 그냥 숫자 기입

v1    50
v2    70
v3    65
v4    90
Name: a, dtype: int32
   v1  v2  v3  v4
a  50  70  65  90
b   2   4   5   6
c   4   5   2   4
   v1  v2  v3  v4
b   2   4   5   6
c   4   5   2   4

C:\ProgramData\Anaconda3\envs\jy3.6\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [12]:
a=df2.iloc[0,2] # df2의 1행 3열 값
aa=df2.iloc[[0,2]] # df2의 1행과 3행 리스트 + df 형태 출력
aaa=df2.iloc[[0,2]].v1 # df2의 v1열 1행과 3행 값
print("1행 3열: {0}\n1행과 3행\n{1}\n(v1,1),(v1,3)\n{2}".format(a,aa,aaa))

1행 3열: 65
1행과 3행
   v1  v2  v3  v4
a  50  70  65  90
c   4   5   2   4
(v1,1),(v1,3)
a    50
c     4
Name: v1, dtype: int32

In [13]:
print(df2.v1)
print(df2["v1"]) # 열 색인, 컬럼 이름 생략 [] 하나
print(df2[["v1"]]) # 열 색인, 컬럼 이름 포함 [[]] 
print(df2[["v1","v2"]]) # 열 색인, 여러 컬럼 [[]]
                                                    # 열 색인은 ':' 쓸 수 없음

a    50
b     2
c     4
Name: v1, dtype: int32
a    50
b     2
c     4
Name: v1, dtype: int32
   v1
a  50
b   2
c   4
   v1  v2
a  50  70
b   2   4
c   4   5

In [14]:
sa=Series([54,3,5],index=["a","c","d"]) # Series에 있으나 df에 없는 인덱스와 값은 생략됨, df에 있으나 series에 없는 인덱스 값은 NaN
df2["v5"]=sa
df2.T

       a    b    c
v1  50.0  2.0  4.0
v2  70.0  4.0  5.0
v3  65.0  5.0  2.0
v4  90.0  6.0  4.0
v5  54.0  NaN  3.0

In [15]:
df2.T["v1","a"]

KeyError: ('v1', 'a')

In [144]:
q=Series([1,2,3,4,5],index=[1,2,3,4,5])
qq=q.reindex([1,2,3,4,5,6],method="bfill")

qq

1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    NaN
dtype: float64

In [155]:
df2.reindex(["a","b","c","d"],method="bfill")

     v1    v2    v3    v4    v5
a  50.0  70.0  65.0  90.0  54.0
b   2.0   4.0   5.0   6.0   NaN
c   4.0   5.0   2.0   4.0   3.0
d   NaN   NaN   NaN   NaN   NaN

In [164]:
df2.drop("a")

   v1  v2  v3  v4   v5
b   2   4   5   6  NaN
c   4   5   2   4  3.0

In [167]:
obj.reindex(["kim","david","han","lee"])

NameError: name 'lee' is not defined

In [182]:
obj[obj>=60]=int("NaN")
obj

ValueError: invalid literal for int() with base 10: 'NaN'

In [226]:
x=np.random.rand(100)
gender=np.where(x>0.5,"M","F")
np.rint(np.random.normal(loc=175,scale=5,size=100))
height=np.rint(np.random.normal(loc=162,scale=5,size=100))
weight=np.where(np.rint(np.random.normal(loc=48,scale=7,size=100))
dfg=DataFrame(np.array([gender,height,weight]).T,columns=["gender","height","weight"])
randd=np.random.rand(100)
selc=randd<0.9
traindfg=dfg[selc]
testdfg=dfg[~selc]
dfg

   gender height weight
0       M  161.0   46.0
1       M  160.0   49.0
2       F  160.0   47.0
3       F  161.0   55.0
4       F  160.0   46.0
5       F  161.0   49.0
6       F  164.0   44.0
7       F  164.0   46.0
8       F  161.0   53.0
9       F  162.0   40.0
10      F  154.0   57.0
11      F  170.0   43.0
12      M  175.0   48.0
13      F  170.0   54.0
14      M  165.0   59.0
15      F  164.0   40.0
16      F  158.0   65.0
17      F  165.0   41.0
18      M  167.0   53.0
19      M  167.0   53.0
20      M  159.0   51.0
21      F  160.0   47.0
22      M  167.0   46.0
23      F  160.0   47.0
24      M  157.0   50.0
25      F  161.0   53.0
26      F  166.0   41.0
27      M  171.0   44.0
28      M  158.0   50.0
29      M  163.0   52.0
..    ...    ...    ...
70      M  165.0   43.0
71      M  166.0   39.0
72      M  158.0   52.0
73      M  171.0   53.0
74      M  165.0   40.0
75      M  171.0   42.0
76      F  157.0   45.0
77      F  154.0   44.0
78      F  167.0   40.0
79      M  170.0   54.0
80      F  167.0   64.0
81      M  163.0   38.0
82      F  162.0   48.0
83      M  164.0   40.0
84      F  165.0   53.0
85      F  165.0   46.0
86      F  161.0   59.0
87      M  167.0   47.0
88      M  160.0   49.0
89      F  164.0   42.0
90      M  163.0   47.0
91      F  161.0   46.0
92      M  165.0   44.0
93      M  169.0   37.0
94      M  164.0   50.0
95      M  162.0   40.0
96      M  165.0   40.0
97      M  165.0   52.0
98      F  166.0   41.0
99      F  174.0   46.0

[100 rows x 3 columns]

In [241]:

obj.add(obj1,fill_value=0)

david     30.0
han      170.0
kim       58.0
lee      130.0
son        NaN
dtype: float64

In [242]:
obj,obj1

(kim      29
 david    30
 han      80
 lee      50
 dtype: int64, kim    29.0
 son     NaN
 lee    80.0
 han    90.0
 dtype: float64)

In [264]:
se=Series([100,100,100],index=["a","b","c"]) # se 인덱스와 대응하는 df 행의 모든 값에 더함. 
df2.add(se,axis=0)
df2

   v1  v2  v3  v4
a  50  70  65  90
b   2   4   5   6
c   4   5   2   4

In [321]:
df3=DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["a","b","c"])
df3

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [283]:
ff=lambda x: x.max()-x.min()
print(df3.apply(ff))

a    6.0
b    6.0
c    6.0
dtype: float64

In [322]:
def f(x):
    return Series([x.min(),x.max(),x.max()-x.min()],index=["최소","최대","범위"])
print(df3.apply(f)) # apply는 각 열을 원소로 하여 연산

def fff(x):
    fa=1
    for i in range(1,(x+1)):  # 각 데이터값의 주소가 1부터 9로 카운트 됨.
        fa*=i
    return fa
print(df3.applymap(fff))

    a  b  c
최소  1  2  3
최대  7  8  9
범위  6  6  6
      a      b       c
0     1      2       6
1    24    120     720
2  5040  40320  362880

In [296]:
df3.sort_values(by="b",ascending =False)

     a    b    c
2  7.0  8.0  9.0
1  4.0  5.0  6.0
0  1.0  2.0  3.0

In [298]:
 df3.sort_index(ascending=False,axis=1)

     c    b    a
0  3.0  2.0  1.0
1  6.0  5.0  4.0
2  9.0  8.0  7.0

In [29]:
df2.iloc[0][2]
df2.rank(method="first")

     v1    v2    v3    v4    v5
a  50.0  70.0  65.0  90.0  54.0
b   2.0   4.0   5.0   6.0   NaN
c   4.0   5.0   2.0   4.0   3.0
d   NaN   NaN   NaN   NaN   NaN

In [31]:
df2.loc["d"]=[3.0,2.0,4.0,5.0,5]
df2

     v1    v2    v3    v4    v5
a  50.0  70.0  65.0  90.0  54.0
b   2.0   4.0   5.0   6.0   NaN
c   4.0   5.0   2.0   4.0   3.0
d   3.0   2.0   4.0   5.0   5.0

In [40]:
df2.index=["a","b","C","C"] # 데이터프레임의 인덱스, 컬럼은 중복 가능

df2.columns=['v1', 'v2', 'v3', 'v4', 'v4']

df2,df2.index.is_unique,df2.columns.is_unique

(     v1    v2    v3    v4    v4
 a  50.0  70.0  65.0  90.0  54.0
 b   2.0   4.0   5.0   6.0   NaN
 C   4.0   5.0   2.0   4.0   3.0
 C   3.0   2.0   4.0   5.0   5.0, False, False)

In [39]:
df2.columns=['v1', 'v2', 'v3', 'v4', 'v4']
df2.columns.is_unique

False

In [328]:
df3.cumsum()

    a   b   c
0   1   2   3
1   5   7   9
2  12  15  18

In [335]:
print("{0}\n\n{1}".format(df2.quantile(q=[0.1,0.5]),df2.describe()))

      v1   v2   v3   v4
0.1  2.4  4.2  2.6  4.4
0.5  4.0  5.0  5.0  6.0

              v1         v2        v3         v4
count   3.000000   3.000000  3.000000   3.000000
mean   18.666667  26.333333  4.000000  33.333333
std    27.153882  37.819748  1.732051  49.084960
min     2.000000   4.000000  2.000000   4.000000
25%     3.000000   4.500000  3.500000   5.000000
50%     4.000000   5.000000  5.000000   6.000000
75%    27.000000  37.500000  5.000000  48.000000
max    50.000000  70.000000  5.000000  90.000000

In [16]:
df2.describe()

              v1         v2         v3         v4         v5
count   3.000000   3.000000   3.000000   3.000000   2.000000
mean   18.666667  26.333333  24.000000  33.333333  28.500000
std    27.153882  37.819748  35.538711  49.084960  36.062446
min     2.000000   4.000000   2.000000   4.000000   3.000000
25%     3.000000   4.500000   3.500000   5.000000  15.750000
50%     4.000000   5.000000   5.000000   6.000000  28.500000
75%    27.000000  37.500000  35.000000  48.000000  41.250000
max    50.000000  70.000000  65.000000  90.000000  54.000000

In [62]:
steel_data=np.loadtxt("C:/Users/Affinity/Desktop/수업/Python_Data/ch02_data/steel.txt",skiprows=5,delimiter='\t')
steel_data
dfs=DataFrame(steel_data,columns=["y","x1","x2"])
dfs["x21"]=dfs.x2*10
print("{0}\n\n{1}".format(steel_data,dfs))

[[ 81.4 195.   57. ]
 [122.2 179.   61. ]
 [101.7 205.   60. ]
 [175.6 204.   62. ]
 [150.3 201.   61. ]
 [ 64.8 184.   54. ]
 [ 92.1 210.   58. ]
 [113.8 209.   61. ]]

       y     x1    x2    x21
0   81.4  195.0  57.0  570.0
1  122.2  179.0  61.0  610.0
2  101.7  205.0  60.0  600.0
3  175.6  204.0  62.0  620.0
4  150.3  201.0  61.0  610.0
5   64.8  184.0  54.0  540.0
6   92.1  210.0  58.0  580.0
7  113.8  209.0  61.0  610.0

In [64]:
print("공분산 행렬:\n{0}\n\nx1,y 공분산:\n{1}\n\n상관계수:\n {2}\n\ny와 x1,x2 상관계수:\n{3}"
      .format(dfs.cov(),dfs.x1.cov(dfs.y),dfs.corr(),dfs.corrwith(dfs.y)))

공분산 행렬:
               y          x1         x2         x21
y    1325.868393  108.855357  85.246429  852.464286
x1    108.855357  131.982143  11.178571  111.785714
x2     85.246429   11.178571   7.357143   73.571429
x21   852.464286  111.785714  73.571429  735.714286

x1,y 공분산:
108.85535714285713

상관계수:
             y        x1        x2       x21
y    1.000000  0.260221  0.863120  0.863120
x1   0.260221  1.000000  0.358735  0.358735
x2   0.863120  0.358735  1.000000  1.000000
x21  0.863120  0.358735  1.000000  1.000000

y와 x1,x2 상관계수:
y      1.000000
x1     0.260221
x2     0.863120
x21    0.863120
dtype: float64

In [82]:
s= Series([1,2,2,3,3,3,4,5,6,7,7])
print(s.isin([3,6])) # 3과 6이 값인 인덱스는 True
print("\n{0}\n\n{1}\n\n".format(s.unique(),s.value_counts()))

0     False
1     False
2     False
3      True
4      True
5      True
6     False
7     False
8      True
9     False
10    False
dtype: bool

[1 2 3 4 5 6 7]

3    3
7    2
2    2
6    1
5    1
4    1
1    1
dtype: int64

In [71]:
print("\n{0}\n\n{1}".format(dfs.x1.unique(),dfs.x1.value_counts()))

[195. 179. 205. 204. 201. 184. 210. 209.]

209.0    1
210.0    1
184.0    1
201.0    1
204.0    1
205.0    1
179.0    1
195.0    1
Name: x1, dtype: int64

In [79]:
print("\n{0}\n\n".format( dfs.apply( pd.value_counts ).fillna(0) ) )

         y   x1   x2  x21
54.0   0.0  0.0  1.0  0.0
57.0   0.0  0.0  1.0  0.0
58.0   0.0  0.0  1.0  0.0
60.0   0.0  0.0  1.0  0.0
61.0   0.0  0.0  3.0  0.0
62.0   0.0  0.0  1.0  0.0
64.8   1.0  0.0  0.0  0.0
81.4   1.0  0.0  0.0  0.0
92.1   1.0  0.0  0.0  0.0
101.7  1.0  0.0  0.0  0.0
113.8  1.0  0.0  0.0  0.0
122.2  1.0  0.0  0.0  0.0
150.3  1.0  0.0  0.0  0.0
175.6  1.0  0.0  0.0  0.0
179.0  0.0  1.0  0.0  0.0
184.0  0.0  1.0  0.0  0.0
195.0  0.0  1.0  0.0  0.0
201.0  0.0  1.0  0.0  0.0
204.0  0.0  1.0  0.0  0.0
205.0  0.0  1.0  0.0  0.0
209.0  0.0  1.0  0.0  0.0
210.0  0.0  1.0  0.0  0.0
540.0  0.0  0.0  0.0  1.0
570.0  0.0  0.0  0.0  1.0
580.0  0.0  0.0  0.0  1.0
600.0  0.0  0.0  0.0  1.0
610.0  0.0  0.0  0.0  3.0
620.0  0.0  0.0  0.0  1.0

# 누락된 데이터

In [102]:
from numpy import nan as Na
np1=np.array([[10,9,Na,np.nan,2],[5,3,None,2,1],[1,2,3,4,Na],[5,3,Na,Na,9]])
dfd=DataFrame(np1,columns=["a","b","c","d","e"],index=[1,2,3,4])
dfd

    a  b     c    d    e
1  10  9   NaN  NaN    2
2   5  3  None    2    1
3   1  2     3    4  NaN
4   5  3   NaN  NaN    9

In [104]:
dfd.isnull()

       a      b      c      d      e
1  False  False   True   True  False
2  False  False   True  False  False
3  False  False  False  False   True
4  False  False   True   True  False

In [107]:
dfd.fillna(method="bfill")

    a  b    c    d  e
1  10  9  3.0  2.0  2
2   5  3  3.0  2.0  1
3   1  2  3.0  4.0  9
4   5  3  NaN  NaN  9

In [108]:
dfd.dropna(axis=1,thresh=3)

    a  b    e
1  10  9    2
2   5  3    1
3   1  2  NaN
4   5  3    9

In [114]:
k=Series([1,2,Na,Na,3,4,Na,Na,5])
k,k.fillna(method="bfill",limit=1),k.fillna(method="bfill",limit=2)

(0    1.0
 1    2.0
 2    NaN
 3    NaN
 4    3.0
 5    4.0
 6    NaN
 7    NaN
 8    5.0
 dtype: float64, 0    1.0
 1    2.0
 2    NaN
 3    3.0
 4    3.0
 5    4.0
 6    NaN
 7    5.0
 8    5.0
 dtype: float64, 0    1.0
 1    2.0
 2    3.0
 3    3.0
 4    3.0
 5    4.0
 6    5.0
 7    5.0
 8    5.0
 dtype: float64)

In [120]:
# 1) 결측값을 0으로 채우기 2) 결측값을 각 열의 평균값으로 채우기
print("1) 0으로 채우기\n{0}\n\n2) 각 열의 평균값으로 채우기\n{1}".format(dfd.fillna(0),dfd.fillna(dfd.mean())))

1) 0으로 채우기
    a  b  c  d  e
1  10  9  0  0  2
2   5  3  0  2  1
3   1  2  3  4  0
4   5  3  0  0  9

2) 각 열의 평균값으로 채우기
    a  b    c    d    e
1  10  9  3.0  3.0  2.0
2   5  3  3.0  2.0  1.0
3   1  2  3.0  4.0  4.0
4   5  3  3.0  3.0  9.0

# 계층적 색인

In [166]:
s2=Series(np.random.binomial(10,0.4,10),index=[["a","a","a","b","b","c","c","c","d","d"],[1,4,3,1,2,1,2,3,1,2]]) # index=[[바깥],[안쪽]]
print("{0}\n\n{1}".format(s2,s2.index))

a  1    4
   4    5
   3    5
b  1    4
   2    3
c  1    5
   2    5
   3    7
d  1    4
   2    4
dtype: int32

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3, 4]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 2, 3, 3], [0, 3, 2, 0, 1, 0, 1, 2, 0, 1]])

In [177]:
s2.iloc[4] # 열 인덱스만 참조

3

In [180]:
print("{0}\n\n{1}".format(s2["c",3], s2[[("c",3),("d",2)]])) # 객체[행,열 인덱스]

7

c  3    7
d  2    4
dtype: int32

In [187]:
print("{0}\n\n{1}".format(s2[["a","c"]], s2[["a","c"]][:,1])) # s2[[복수개의 행 인덱스]][:는 앞에서 선택한 행 인덱스 전체, 열 인덱스 2]

a  1    4
   4    5
   3    5
c  1    5
   2    5
   3    7
dtype: int32

a    4
c    5
dtype: int32

In [141]:
s2.unstack() # 데이터프레임화, 바깥 인뎃스가 행 인덱스, 안쪽 인덱스가 열 속성으로 설정됨
s2.unstack().stack() # df를 다시 series로, 인덱스가 정렬되어서 바뀜.
print("{0}\n\n{1}".format(s2.unstack(), s2.unstack().stack()))

     1    2    3    4
a  6.0  NaN  7.0  6.0
b  6.0  3.0  NaN  NaN
c  5.0  4.0  3.0  NaN
d  3.0  5.0  NaN  NaN

a  1    6.0
   3    7.0
   4    6.0
b  1    6.0
   2    3.0
c  1    5.0
   2    4.0
   3    3.0
d  1    3.0
   2    5.0
dtype: float64

In [192]:
np.random.seed(100)
dfm=np.array(np.random.binomial(10,0.6,40)).reshape(10,4)
df4=DataFrame(dfm,index=[["a","a","a","b","b","c","c","c","d","d"],[1,4,3,1,2,1,2,3,1,2]],columns=[["서울","서울","경기","경기"],["F","M","F","M"]])
df4.index.names=["학교","학년"]
df4.columns.names=["지역","성별"]
df4

지역     서울     경기
성별      F  M   F  M
학교 학년
a  1    6  7   6  4
   4   10  8   5  5
   3    8  6   4  7
b  1    7  8   7  3
   2    5  7   5  7
c  1    6  4   5  7
   2    7  7  10  7
   3    5  9   6  6
d  1    8  7   9  4
   2    3  8   4  6

In [193]:
print("{0}\n\n{1}".format(df4.index,df4.columns))

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3, 4]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 2, 3, 3], [0, 3, 2, 0, 1, 0, 1, 2, 0, 1]],
           names=['학교', '학년'])

MultiIndex(levels=[['경기', '서울'], ['F', 'M']],
           codes=[[1, 1, 0, 0], [0, 1, 0, 1]],
           names=['지역', '성별'])

In [207]:
df4.loc["a"][[("서울","M"),("경기","M")]]

지역 서울 경기
성별  M  M
학년
1   7  4
4   8  5
3   6  7

In [215]:
df4.loc["a",1][[("서울","M"),("경기","M")]]

지역  성별
서울  M     7
경기  M     4
Name: (a, 1), dtype: int32

In [211]:
df4.loc["a"][[("서울")]]

지역  서울
성별   F  M
학년
1    6  7
4   10  8
3    8  6

In [227]:
print("{0}\n\n{1}".format(df4.swaplevel(i=1,j=0).sort_index(0),df4.swaplevel(i=1,j=0).sort_index(1)))

지역     서울     경기
성별      F  M   F  M
학년 학교
1  a    6  7   6  4
   b    7  8   7  3
   c    6  4   5  7
   d    8  7   9  4
2  b    5  7   5  7
   c    7  7  10  7
   d    3  8   4  6
3  a    8  6   4  7
   c    5  9   6  6
4  a   10  8   5  5

지역     경기     서울
성별      F  M   F  M
학년 학교
1  a    6  4   6  7
4  a    5  5  10  8
3  a    4  7   8  6
1  b    7  3   7  8
2  b    5  7   5  7
1  c    5  7   6  4
2  c   10  7   7  7
3  c    6  6   5  9
1  d    9  4   8  7
2  d    4  6   3  8

In [233]:
df4.sum(axis=1) # 열 기준 합계

학교  학년
a   1     23
    4     28
    3     25
b   1     25
    2     24
c   1     22
    2     31
    3     26
d   1     28
    2     21
dtype: int64

In [234]:
df4.sum(level="학교",axis=0) # 학교별 행 합계

지역  서울      경기
성별   F   M   F   M
학교
a   24  21  15  16
b   12  15  12  10
c   18  20  21  20
d   11  15  13  10

In [237]:
np.random.seed(200)
dfm2=np.array(np.random.binomial(10,0.5,20)).reshape(10,2)
df5=DataFrame(dfm2,columns=["v1","v2"])
df5["v3"]=["M","M","F","M","M","M","F","F","F","M"]
df5["v4"]=["a","a","a","b","b","c","c","c","d","d"]
df5

   v1  v2 v3 v4
0   8   4  M  a
1   5   5  M  a
2   6   1  F  a
3   4   7  M  b
4   5   8  M  b
5   7   8  M  c
6   7   4  F  c
7   7   3  F  c
8   6   4  F  d
9   3   7  M  d

In [242]:
print("{0}\n\n{1}".format(df5.set_index(["v3","v4"]),df5.set_index("v3","v4")))

       v1  v2
v3 v4
M  a    8   4
   a    5   5
F  a    6   1
M  b    4   7
   b    5   8
   c    7   8
F  c    7   4
   c    7   3
   d    6   4
M  d    3   7

    v1  v2 v4
v3
M    8   4  a
M    5   5  a
F    6   1  a
M    4   7  b
M    5   8  b
M    7   8  c
F    7   4  c
F    7   3  c
F    6   4  d
M    3   7  d

In [249]:
(df5.set_index(["v3","v4"])).reset_index(level="v4") # 열 인덱스 v4를 다시 변수로 변경

   v4  v1  v2
v3
M   a   8   4
M   a   5   5
F   a   6   1
M   b   4   7
M   b   5   8
M   c   7   8
F   c   7   4
F   c   7   3
F   d   6   4
M   d   3   7